import pygame_gui
import pygame

from source.menu.menu_scripts.statistics_scripts import grab_best_races

# ---------------------------------------------------------------------------------------------------------------------


def load_statistics_ui(self) -> None:
    # -----------------------------------------------------------------------------------------------------------------
    """Подгрузка интерфейса окна статистики"""
    self.manager = pygame_gui.UIManager(self.size, "data/theme.json")  # МЕНЕДЖЕР ГРАФИЧЕСКОГО ИНТЕРФЕЙСА
    pygame.display.set_caption("СТАТИСТИКА")  # УСТАНОВКА НАЗВАНИЯ ОКНА
    self.best_races = grab_best_races()

    # -----------------------------------------------------------------------------------------------------------------
    # КНОПКА ВОЗВРАЩЕНИЯ В ГЛАВНОЕ МЕНЮ
    self.back_button = pygame_gui.elements.UIButton(
        relative_rect=pygame.Rect((self.w // 90, self.h * 5 // 6), (self.w // 3, self.h // 7)),
        text="В ГЛАВНОЕ МЕНЮ",
        manager=self.manager,
    )

    self.status = "statistics"  # УСТАНОВКА СТАТУСА ОКНА СТАТИСТИКИ

    # -----------------------------------------------------------------------------------------------------------------
# ---------------------------------------------------------------------------------------------------------------------
